app/Controllers/Auth.php

    public function login()
    {
        $model = new UserModel();

        $email = trim($this->request->getPost('email'));
        $password = trim($this->request->getPost('password'));

        // ❌ validation champs vides
        if ($email == '' || $password == '') {
            return redirect()->to('/login')
                ->with('error', 'Veuillez remplir tous les champs');
        }

        // 🔍 recherche user
        $user = $model->where('email', $email)
                      ->where('password', $password)
                      ->first();
---
SELECT *
FROM `users`
WHERE `email` = 'admin@sysinfo.mg'
AND `password` = 'password'
 LIMIT 1