app/Controllers/Home.php

SELECT COUNT(*) AS `numrows`
FROM `eleves`
JOIN `parcours` ON `parcours`.`id` = `eleves`.`idParcours`
SELECT `eleves`.*, `parcours`.`nomParcours`
FROM `eleves`
JOIN `parcours` ON `parcours`.`id` = `eleves`.`idParcours`
 LIMIT 2
---
    public function list()
    {
        // Vérifier que l'utilisateur est connecté
        if (!session()->get('user')) {
            return redirect()->to('/login');
        }

        $model = new \App\Models\ElevesModel();

        $perPage = 2;
        $keyword = $this->request->getGet('q');

        $builder = $model
            ->select('eleves.*, parcours.nomParcours')
            ->join('parcours', 'parcours.id = eleves.idParcours');

        if (!empty($keyword)) {
            $builder = $builder->like('eleves.ETU', $keyword);
        }

        $eleves = $builder->paginate($perPage);