app/Controllers/Notes_tranches.php

SELECT `eleves`.`nom`, AVG(notesEleves.valeurNote) as moyenne
FROM `notesEleves`
JOIN `eleves` ON `eleves`.`id` = `notesEleves`.`idEleve`
JOIN `matieres` ON `matieres`.`id` = `notesEleves`.`idMatiere`
JOIN `programmeParcours` ON `programmeParcours`.`idMatiere` = `matieres`.`id`
WHERE `programmeParcours`.`numSemestre` IN (3,4)
GROUP BY `eleves`.`id`
---
    public function notes_tranches($type = null)
    {
        $model = new NotesElevesModel();

        $builder = $model
            ->select('eleves.nom, matieres.intituleMatiere, notesEleves.valeurNote, programmeParcours.numSemestre')
            ->join('eleves', 'eleves.id = notesEleves.idEleve')
            ->join('matieres', 'matieres.id = notesEleves.idMatiere')
            ->join('programmeParcours', 'programmeParcours.idMatiere = matieres.id');

        // S3
        if ($type == 'S3') {
            $builder->where('programmeParcours.numSemestre', 3);
        }

        // S4
        if ($type == 'S4') {
            $builder->where('programmeParcours.numSemestre', 4);
        }

        $notes = $builder->findAll();

        // L2 = moyenne S3 + S4
        if ($type == 'L2') {

            $notes = $model
                ->select('eleves.nom, AVG(notesEleves.valeurNote) as moyenne')
                ->join('eleves', 'eleves.id = notesEleves.idEleve')
                ->join('matieres', 'matieres.id = notesEleves.idMatiere')
                ->join('programmeParcours', 'programmeParcours.idMatiere = matieres.id')
                ->whereIn('programmeParcours.numSemestre', [3, 4])
                ->groupBy('eleves.id')
                ->findAll();