app/Controllers/NotesController.php

SELECT `e`.`id`, `e`.`nom`, `e`.`ETU`, `e`.`idParcours`, `p`.`nomParcours`
FROM `eleves` `e`
LEFT JOIN `parcours` `p` ON `e`.`idParcours` = `p`.`id`
---
    public function index(): string
    {
        $db = \Config\Database::connect();
        $eleves = $db->table('eleves e')
            ->select('e.id, e.nom, e.ETU, e.idParcours, p.nomParcours')
            ->join('parcours p', 'e.idParcours = p.id', 'left')
            ->get()
            ->getResultArray();

SELECT *
FROM `eleves`
WHERE `eleves`.`id` = 1
SELECT *
FROM `matieres`
SELECT *
FROM `notesEleves`
WHERE `idEleve` = 1
AND `idMatiere` = '1'
 LIMIT 1
---
    public function formulaire(int $idEleve): string
    {
        $eleve = $this->elevesModel->find($idEleve);

        if (!$eleve) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Élève non trouvé');
        }

        $matieres = $this->matieresModel->findAll();
        $matieres_avec_notes = [];

        foreach ($matieres as $matiere) {
            $noteExistante = $this->notesElevesModel->where('idEleve', $idEleve)
                ->where('idMatiere', $matiere['id'])
                ->first();

SELECT *
FROM `eleves`
WHERE `eleves`.`id` = '1'
SELECT *
FROM `notesEleves`
WHERE `idEleve` = '1'
AND `idMatiere` = 1
 LIMIT 1
UPDATE `notesEleves` SET `valeurNote` = '12.50'
WHERE `notesEleves`.`id` IN ('1')
INSERT INTO `notesEleves` (`idEleve`, `idMatiere`, `valeurNote`, `numSemestre`) VALUES ('1', 2, '10', 3)
---
    public function add(): RedirectResponse
    {
        $idEleve = $this->request->getPost('idEleve');

        if (!$idEleve || !$this->elevesModel->find($idEleve)) {
            return redirect()->back()->with('error', 'Élève invalide.');
        }

        $notes = $this->request->getPost('notes') ?? [];

        foreach ($notes as $idMatiere => $valeurNote) {
            $valeurNote = trim($valeurNote);

            // Vérifier si une note existe déjà
            $noteExistante = $this->notesElevesModel->where('idEleve', $idEleve)
                ->where('idMatiere', $idMatiere)
                ->first();

            if (!empty($valeurNote)) {
                // Valider la note
                if (!is_numeric($valeurNote) || $valeurNote < 0 || $valeurNote > 20) {
                    return redirect()->back()->withInput()->with('error', 'Note invalide pour la matière ID ' . $idMatiere);
                }

                if ($noteExistante) {
                    // Mise à jour
                    $this->notesElevesModel->update($noteExistante['id'], [
                        'valeurNote' => $valeurNote,
                    ]);
                } else {
                    // Insertion
                    $this->notesElevesModel->insert([
                        'idEleve' => $idEleve,
                        'idMatiere' => $idMatiere,
                        'valeurNote' => $valeurNote,
                    ]);